cfd/K_024/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  14
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0)
    (0.731648018 0.0660373372 -0.00288325241)
    (0.731648018 0.0660373372 0.00288325241)
    (0.889 0.0513715039 -0.0022429283)
    (0.889 0.0513715039 0.0022429283)
    (0.913 0.0445747695 -0.00194617647)
    (0.913 0.0445747695 0.00194617647)
    (0.918974059 0.0425837108 -0.00185924497)
    (0.918974059 0.0425837108 0.00185924497)
    (1 0 -0)
    (-4 0 -0)
    (0.731648018 3.9904332 -0.174226076)
    (0.731648018 3.9904332 0.174226076)
    (0.889 3.99520802 -0.174434549)
    (0.889 3.99520802 0.174434549)
    (0.913 3.9955879 -0.174451135)
    (0.913 3.9955879 0.174451135)
    (0.918974059 3.99566814 -0.174454638)
    (0.918974059 3.99566814 0.174454638)
    (1 3.99619289 -0.174477549)
    (1 3.99619289 0.174477549)
    (8 0 -0)
    (8 3.99619289 -0.174477549)
    (8 3.99619289 0.174477549)
);

blocks
(
    hex (0 1 11 10 0 2 12 10) (110 110 1)
    edgeGrading (((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3))  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (1 3 13 11 2 4 14 12) (70 110 1)
    edgeGrading (((0.7 0.6 1) (0.3 0.4 0.15)) ((0.7 0.6 1) (0.3 0.4 0.15)) ((0.7 0.6 1) (0.3 0.4 0.15)) ((0.7 0.6 1) (0.3 0.4 0.15))  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (3 5 15 13 4 6 16 14) (16 110 1)
    edgeGrading (1 1 1 1  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (5 7 17 15 6 8 18 16) (12 110 1)
    edgeGrading (1 1 1 1  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (7 9 19 17 8 9 20 18) (60 110 1)
    edgeGrading (((0.3 0.5 3) (0.7 0.5 0.3)) ((0.3 0.5 3) (0.7 0.5 0.3)) ((0.3 0.5 3) (0.7 0.5 0.3)) ((0.3 0.5 3) (0.7 0.5 0.3))  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (9 21 22 19 9 21 23 20) (160 110 1)
    edgeGrading (40 40 40 40  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
);

edges
(
...
    polyLine 10 11 ((-3.99315973 0.208960684 -0.00912342048) (-3.97265762 0.417349628 -0.0182218783) (-3.93854978 0.624596659 -0.0272704791) (-3.89092953 0.830134724 -0.0362444648) (-3.82992716 1.03340145 -0.0451192817) (-3.75570958 1.23384068 -0.0538706474) (-3.66847986 1.43090398 -0.062474617) (-3.56847667 1.62405218 -0.0709076493) (-3.45597363 1.81275678 -0.0791466705) (-3.33127856 1.99650149 -0.0871691377) (-3.19473263 2.17478356 -0.0949531007) (-3.04670946 2.34711517 -0.102477262) (-2.88761405 2.51302483 -0.109721033) (-2.7178817 2.67205857 -0.116664597) (-2.53797682 2.82378127 -0.123288953) (-2.34839165 2.96777779 -0.129575977) (-2.14964491 3.10365415 -0.135508467) (-1.9422804 3.23103857 -0.141070191) (-1.72686549 3.34958252 -0.146245931) (-1.50398958 3.45896164 -0.151021527) (-1.27426248 3.55887667 -0.155383911) (-1.03831274 3.64905422 -0.159321148) (-0.796785965 3.72924756 -0.162822465) (-0.550342983 3.79923727 -0.165878282) (-0.299658093 3.85883185 -0.168480237) (-0.0454171965 3.90786825 -0.170621212) (0.211684076 3.94621229 -0.172295349) (0.470942267 3.97375906 -0.173498068))
...
    polyLine 10 12 ((-3.99315973 0.208960684 0.00912342048) (-3.97265762 0.417349628 0.0182218783) (-3.93854978 0.624596659 0.0272704791) (-3.89092953 0.830134724 0.0362444648) (-3.82992716 1.03340145 0.0451192817) (-3.75570958 1.23384068 0.0538706474) (-3.66847986 1.43090398 0.062474617) (-3.56847667 1.62405218 0.0709076493) (-3.45597363 1.81275678 0.0791466705) (-3.33127856 1.99650149 0.0871691377) (-3.19473263 2.17478356 0.0949531007) (-3.04670946 2.34711517 0.102477262) (-2.88761405 2.51302483 0.109721033) (-2.7178817 2.67205857 0.116664597) (-2.53797682 2.82378127 0.123288953) (-2.34839165 2.96777779 0.129575977) (-2.14964491 3.10365415 0.135508467) (-1.9422804 3.23103857 0.141070191) (-1.72686549 3.34958252 0.146245931) (-1.50398958 3.45896164 0.151021527) (-1.27426248 3.55887667 0.155383911) (-1.03831274 3.64905422 0.159321148) (-0.796785965 3.72924756 0.162822465) (-0.550342983 3.79923727 0.165878282) (-0.299658093 3.85883185 0.168480237) (-0.0454171965 3.90786825 0.170621212) (0.211684076 3.94621229 0.172295349) (0.470942267 3.97375906 0.173498068))
    polyLine 1 3 ((0.736275382 0.0660310368 -0.00288297733) (0.740876837 0.0660108719 -0.00288209691) (0.745451877 0.0659762914 -0.00288058709) (0.75 0.0659267457 -0.00287842388) (0.754520708 0.0658616876 -0.00287558338) (0.759013505 0.065780574 -0.00287204188) (0.763477898 0.0656828676 -0.00286777593) (0.767913397 0.0655680384 -0.00286276238) (0.772319518 0.0654355651 -0.00285697847) (0.776695775 0.0652849369 -0.0028504019) (0.781041689 0.0651156549 -0.00284301089) (0.785356784 0.0649272341 -0.00283478426) (0.789640586 0.0647192048 -0.00282570151) (0.793892626 0.0644911144 -0.00281574286) (0.798112437 0.0642425287 -0.00280488938) (0.802299557 0.063973034 -0.00279312298) (0.806453527 0.0636822384 -0.00278042658) (0.81057389 0.0633697738 -0.00276678408) (0.814660196 0.0630352968 -0.0027521805) (0.818711995 0.0626784912 -0.00273660203) (0.822728844 0.0622990686 -0.00272003608) (0.826710302 0.0618967706 -0.00270247137) (0.830655933 0.0614713699 -0.00268389797) (0.834565303 0.0610226718 -0.00266430739) (0.838437985 0.0605505157 -0.00264369261) (0.842273553 0.0600547761 -0.00262204815) (0.846071587 0.0595353641 -0.00259937013) (0.84983167 0.0589922286 -0.00257565633) (0.853553391 0.0584253572 -0.00255090618) (0.85723634 0.0578347774 -0.00252512091) (0.860880114 0.0572205574 -0.00249830349) (0.864484314 0.0565828075 -0.00247045873) (0.868048544 0.05592168 -0.00244159328) (0.871572413 0.0552373708 -0.00241171569) (0.875055535 0.0545301195 -0.00238083643) (0.878497528 0.0538002099 -0.00234896789) (0.881898014 0.053047971 -0.00231612443) (0.885256621 0.0522737764 -0.00228232237) (0.888572981 0.0514780455 -0.00224758001))
    polyLine 11 13 ((0.737070413 3.99066377 -0.174236143) (0.742493118 3.99088963 -0.174246004) (0.747916127 3.99111079 -0.17425566) (0.753339433 3.99132724 -0.174265111) (0.75876303 3.99153899 -0.174274356) (0.764186912 3.99174602 -0.174283395) (0.769611071 3.99194835 -0.174292229) (0.775035503 3.99214597 -0.174300857) (0.7804602 3.99233888 -0.17430928) (0.785885155 3.99252708 -0.174317497) (0.791310364 3.99271058 -0.174325509) (0.796735818 3.99288936 -0.174333314) (0.802161512 3.99306344 -0.174340915) (0.80758744 3.9932328 -0.174348309) (0.813013594 3.99339746 -0.174355498) (0.818439969 3.9935574 -0.174362482) (0.823866558 3.99371264 -0.17436926) (0.829293355 3.99386317 -0.174375832) (0.834720353 3.99400898 -0.174382198) (0.840147546 3.99415009 -0.174388359) (0.845574928 3.99428648 -0.174394314) (0.851002492 3.99441816 -0.174400063) (0.856430231 3.99454513 -0.174405607) (0.86185814 3.99466739 -0.174410945) (0.867286212 3.99478494 -0.174416077) (0.87271444 3.99489778 -0.174421004) (0.878142818 3.99500591 -0.174425725) (0.883571341 3.99510932 -0.17443024))
    polyLine 2 4 ((0.736275382 0.0660310368 0.00288297733) (0.740876837 0.0660108719 0.00288209691) (0.745451877 0.0659762914 0.00288058709) (0.75 0.0659267457 0.00287842388) (0.754520708 0.0658616876 0.00287558338) (0.759013505 0.065780574 0.00287204188) (0.763477898 0.0656828676 0.00286777593) (0.767913397 0.0655680384 0.00286276238) (0.772319518 0.0654355651 0.00285697847) (0.776695775 0.0652849369 0.0028504019) (0.781041689 0.0651156549 0.00284301089) (0.785356784 0.0649272341 0.00283478426) (0.789640586 0.0647192048 0.00282570151) (0.793892626 0.0644911144 0.00281574286) (0.798112437 0.0642425287 0.00280488938) (0.802299557 0.063973034 0.00279312298) (0.806453527 0.0636822384 0.00278042658) (0.81057389 0.0633697738 0.00276678408) (0.814660196 0.0630352968 0.0027521805) (0.818711995 0.0626784912 0.00273660203) (0.822728844 0.0622990686 0.00272003608) (0.826710302 0.0618967706 0.00270247137) (0.830655933 0.0614713699 0.00268389797) (0.834565303 0.0610226718 0.00266430739) (0.838437985 0.0605505157 0.00264369261) (0.842273553 0.0600547761 0.00262204815) (0.846071587 0.0595353641 0.00259937013) (0.84983167 0.0589922286 0.00257565633) (0.853553391 0.0584253572 0.00255090618) (0.85723634 0.0578347774 0.00252512091) (0.860880114 0.0572205574 0.00249830349) (0.864484314 0.0565828075 0.00247045873) (0.868048544 0.05592168 0.00244159328) (0.871572413 0.0552373708 0.00241171569) (0.875055535 0.0545301195 0.00238083643) (0.878497528 0.0538002099 0.00234896789) (0.881898014 0.053047971 0.00231612443) (0.885256621 0.0522737764 0.00228232237) (0.888572981 0.0514780455 0.00224758001))
    polyLine 12 14 ((0.737070413 3.99066377 0.174236143) (0.742493118 3.99088963 0.174246004) (0.747916127 3.99111079 0.17425566) (0.753339433 3.99132724 0.174265111) (0.75876303 3.99153899 0.174274356) (0.764186912 3.99174602 0.174283395) (0.769611071 3.99194835 0.174292229) (0.775035503 3.99214597 0.174300857) (0.7804602 3.99233888 0.17430928) (0.785885155 3.99252708 0.174317497) (0.791310364 3.99271058 0.174325509) (0.796735818 3.99288936 0.174333314) (0.802161512 3.99306344 0.174340915) (0.80758744 3.9932328 0.174348309) (0.813013594 3.99339746 0.174355498) (0.818439969 3.9935574 0.174362482) (0.823866558 3.99371264 0.17436926) (0.829293355 3.99386317 0.174375832) (0.834720353 3.99400898 0.174382198) (0.840147546 3.99415009 0.174388359) (0.845574928 3.99428648 0.174394314) (0.851002492 3.99441816 0.174400063) (0.856430231 3.99454513 0.174405607) (0.86185814 3.99466739 0.174410945) (0.867286212 3.99478494 0.174416077) (0.87271444 3.99489778 0.174421004) (0.878142818 3.99500591 0.174425725) (0.883571341 3.99510932 0.17443024))
    polyLine 3 5 ((0.891846729 0.050661243 -0.00221191764) (0.895077506 0.0498238788 -0.00217535753) (0.898264959 0.0489665087 -0.00213792394) (0.901408738 0.0480897333 -0.0020996431) (0.904508497 0.0471941983 -0.0020605432) (0.907563898 0.0462805936 -0.00202065435) (0.910574605 0.0453496532 -0.00198000862))
    polyLine 13 15 ((0.889827547 3.99522266 -0.174435188) (0.890655097 3.99523718 -0.174435822) (0.891482649 3.99525159 -0.174436452) (0.892310205 3.99526589 -0.174437076) (0.893137764 3.99528009 -0.174437696) (0.893965326 3.99529417 -0.174438311) (0.89479289 3.99530815 -0.174438921) (0.895620458 3.99532201 -0.174439526) (0.896448028 3.99533577 -0.174440127) (0.897275601 3.99534942 -0.174440723) (0.898103177 3.99536295 -0.174441314) (0.898930756 3.99537638 -0.1744419) (0.899758337 3.9953897 -0.174442482) (0.900585922 3.99540291 -0.174443058) (0.901413509 3.99541601 -0.17444363) (0.902241098 3.995429 -0.174444197) (0.903068691 3.99544188 -0.17444476) (0.903896286 3.99545465 -0.174445317) (0.904723883 3.99546731 -0.17444587) (0.905551484 3.99547986 -0.174446418) (0.906379087 3.9954923 -0.174446961) (0.907206692 3.99550463 -0.1744475) (0.9080343 3.99551686 -0.174448033) (0.90886191 3.99552897 -0.174448562) (0.909689523 3.99554098 -0.174449086) (0.910517139 3.99555287 -0.174449606) (0.911344757 3.99556466 -0.17445012) (0.912172377 3.99557633 -0.17445063))
    polyLine 4 6 ((0.891846729 0.050661243 0.00221191764) (0.895077506 0.0498238788 0.00217535753) (0.898264959 0.0489665087 0.00213792394) (0.901408738 0.0480897333 0.0020996431) (0.904508497 0.0471941983 0.0020605432) (0.907563898 0.0462805936 0.00202065435) (0.910574605 0.0453496532 0.00198000862))
    polyLine 14 16 ((0.889827547 3.99522266 0.174435188) (0.890655097 3.99523718 0.174435822) (0.891482649 3.99525159 0.174436452) (0.892310205 3.99526589 0.174437076) (0.893137764 3.99528009 0.174437696) (0.893965326 3.99529417 0.174438311) (0.89479289 3.99530815 0.174438921) (0.895620458 3.99532201 0.174439526) (0.896448028 3.99533577 0.174440127) (0.897275601 3.99534942 0.174440723) (0.898103177 3.99536295 0.174441314) (0.898930756 3.99537638 0.1744419) (0.899758337 3.9953897 0.174442482) (0.900585922 3.99540291 0.174443058) (0.901413509 3.99541601 0.17444363) (0.902241098 3.995429 0.174444197) (0.903068691 3.99544188 0.17444476) (0.903896286 3.99545465 0.174445317) (0.904723883 3.99546731 0.17444587) (0.905551484 3.99547986 0.174446418) (0.906379087 3.9954923 0.174446961) (0.907206692 3.99550463 0.1744475) (0.9080343 3.99551686 0.174448033) (0.90886191 3.99552897 0.174448562) (0.909689523 3.99554098 0.174449086) (0.910517139 3.99555287 0.174449606) (0.911344757 3.99556466 0.17445012) (0.912172377 3.99557633 0.17445063))
    polyLine 5 7 ((0.913540287 0.0444021545 -0.00193863993) (0.91646062 0.0434389171 -0.00189658408))
    polyLine 15 17 ((0.913206 3.99559076 -0.17445126) (0.913412 3.99559361 -0.174451385) (0.913618 3.99559646 -0.174451509) (0.913824001 3.9955993 -0.174451633) (0.914030001 3.99560214 -0.174451757) (0.914236002 3.99560497 -0.17445188) (0.914442003 3.99560779 -0.174452003) (0.914648004 3.9956106 -0.174452126) (0.914854005 3.99561341 -0.174452249) (0.915060007 3.99561621 -0.174452371) (0.915266008 3.995619 -0.174452493) (0.91547201 3.99562179 -0.174452615) (0.915678011 3.99562457 -0.174452736) (0.915884013 3.99562735 -0.174452857) (0.916090015 3.99563011 -0.174452978) (0.916296017 3.99563287 -0.174453099) (0.91650202 3.99563563 -0.174453219) (0.916708022 3.99563837 -0.174453339) (0.916914025 3.99564111 -0.174453458) (0.917120028 3.99564384 -0.174453578) (0.91732603 3.99564657 -0.174453697) (0.917532034 3.99564929 -0.174453816) (0.917738037 3.995652 -0.174453934) (0.91794404 3.99565471 -0.174454052) (0.918150043 3.99565741 -0.17445417) (0.918356047 3.9956601 -0.174454287) (0.918562051 3.99566278 -0.174454405) (0.918768055 3.99566546 -0.174454522))
    polyLine 6 8 ((0.913540287 0.0444021545 0.00193863993) (0.91646062 0.0434389171 0.00189658408))
    polyLine 16 18 ((0.913206 3.99559076 0.17445126) (0.913412 3.99559361 0.174451385) (0.913618 3.99559646 0.174451509) (0.913824001 3.9955993 0.174451633) (0.914030001 3.99560214 0.174451757) (0.914236002 3.99560497 0.17445188) (0.914442003 3.99560779 0.174452003) (0.914648004 3.9956106 0.174452126) (0.914854005 3.99561341 0.174452249) (0.915060007 3.99561621 0.174452371) (0.915266008 3.995619 0.174452493) (0.91547201 3.99562179 0.174452615) (0.915678011 3.99562457 0.174452736) (0.915884013 3.99562735 0.174452857) (0.916090015 3.99563011 0.174452978) (0.916296017 3.99563287 0.174453099) (0.91650202 3.99563563 0.174453219) (0.916708022 3.99563837 0.174453339) (0.916914025 3.99564111 0.174453458) (0.917120028 3.99564384 0.174453578) (0.91732603 3.99564657 0.174453697) (0.917532034 3.99564929 0.174453816) (0.917738037 3.995652 0.174453934) (0.91794404 3.99565471 0.174454052) (0.918150043 3.99565741 0.17445417) (0.918356047 3.9956601 0.174454287) (0.918562051 3.99566278 0.174454405) (0.918768055 3.99566546 0.174454522))
...
    polyLine 17 19 ((0.921767824 3.9957037 -0.174456191) (0.924561615 3.99573802 -0.174457689) (0.927355429 3.99577109 -0.174459133) (0.930149265 3.99580291 -0.174460523) (0.932943124 3.99583348 -0.174461858) (0.935737003 3.99586281 -0.174463138) (0.938530902 3.99589089 -0.174464364) (0.941324821 3.99591772 -0.174465535) (0.944118758 3.9959433 -0.174466652) (0.946912712 3.99596763 -0.174467715) (0.949706683 3.99599072 -0.174468723) (0.95250067 3.99601256 -0.174469676) (0.955294671 3.99603315 -0.174470575) (0.958088687 3.99605249 -0.17447142) (0.960882715 3.99607059 -0.17447221) (0.963676756 3.99608744 -0.174472945) (0.966470808 3.99610303 -0.174473626) (0.96926487 3.99611739 -0.174474253) (0.972058943 3.99613049 -0.174474825) (0.974853023 3.99614234 -0.174475343) (0.977647112 3.99615295 -0.174475806) (0.980441208 3.99616231 -0.174476215) (0.98323531 3.99617042 -0.174476569) (0.986029417 3.99617729 -0.174476868) (0.988823528 3.9961829 -0.174477114) (0.991617643 3.99618727 -0.174477304) (0.994411761 3.99619039 -0.17447744) (0.99720588 3.99619226 -0.174477522))
...
    polyLine 18 20 ((0.921767824 3.9957037 0.174456191) (0.924561615 3.99573802 0.174457689) (0.927355429 3.99577109 0.174459133) (0.930149265 3.99580291 0.174460523) (0.932943124 3.99583348 0.174461858) (0.935737003 3.99586281 0.174463138) (0.938530902 3.99589089 0.174464364) (0.941324821 3.99591772 0.174465535) (0.944118758 3.9959433 0.174466652) (0.946912712 3.99596763 0.174467715) (0.949706683 3.99599072 0.174468723) (0.95250067 3.99601256 0.174469676) (0.955294671 3.99603315 0.174470575) (0.958088687 3.99605249 0.17447142) (0.960882715 3.99607059 0.17447221) (0.963676756 3.99608744 0.174472945) (0.966470808 3.99610303 0.174473626) (0.96926487 3.99611739 0.174474253) (0.972058943 3.99613049 0.174474825) (0.974853023 3.99614234 0.174475343) (0.977647112 3.99615295 0.174475806) (0.980441208 3.99616231 0.174476215) (0.98323531 3.99617042 0.174476569) (0.986029417 3.99617729 0.174476868) (0.988823528 3.9961829 0.174477114) (0.991617643 3.99618727 0.174477304) (0.994411761 3.99619039 0.17447744) (0.99720588 3.99619226 0.174477522))
);

defaultPatch { name defaultFaces; type empty; }

boundary
(
    corpo { type wall; faces ((0 1 2 0) (1 3 4 2) (7 9 9 8)); }
    esterno { type patch; faces ((10 11 12 10) (11 13 14 12) (13 15 16 14) (15 17 18 16) (17 19 20 18) (19 22 23 20)); }
    front { type wedge; faces ((0 1 11 10) (1 3 13 11) (3 5 15 13) (5 7 17 15) (7 9 19 17) (9 21 22 19)); }
    back { type wedge; faces ((0 10 12 2) (2 12 14 4) (4 14 16 6) (6 16 18 8) (8 18 20 9) (9 20 23 21)); }
    presa { type patch; faces ((3 5 6 4)); }
    scarico { type patch; faces ((5 7 8 6)); }
    uscita { type patch; faces ((21 22 23 21)); }
);
